Autodesk.Revit.DB.Architecture.BalusterPattern.RemoveBaluster(System.Int32)
Removes a baluster from the main baluster pattern.
index:
Baluster index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index index is out of range.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.DuplicateBaluster(System.Int32)
Duplicates the baluster pointed by given index in the main baluster pattern.
Remarks:
The new baluster will be inserted just after the source baluster.
index:
Baluster index.
Returns:
The duplicated baluster.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index index is out of range.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.GetBaluster(System.Int32)
Gets information about the given baluster from the main baluster pattern.
index:
The baluster index.
Returns:
The requested baluster or null if index is out of range.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.GetBalusterCount
Gets the number of balusters in the main baluster pattern definition.
Returns:
The number of balusters in the main baluster pattern.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.BalusterPattern.Length
The length of the main baluster pattern.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.DistributionJustification
Determines how baluster pattern distribution is justified.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.BreakPattern
The condition which controls breaking baluster patterns distribution.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.ExcessLengthFillSpacing
The value defines the spacing between each baluster instance inserted in the excess length.
Remarks:
The spacing is used only if a baluster family is set to excess length fill.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for excessLengthFillSpacing must be between 0 and 30000 feet.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.ExcessLengthFillBalusterId
The id of a Baluster family used to fill excess length, which is the extra space
along the railing segment that cannot be filled with a pattern.
If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid ElementId for leftoverFill of BalusterPattern
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.PatternAngle
The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for patternAngle is not finite
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern.EndSpace
The extra space added after a whole baluster pattern.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for endSpace must be between 0 and 30000 feet.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterPattern
Baluster pattern class.
Since:
2019